//Напишите программу для расчета корней квадратного уравнения с проверкой
//неотрицательности дискриминанта.Если дискриминант отрицательный, сообщайте
//пользователю, что уравнение не имеет корней.Добавьте проверку того, что первый
//коэффициент не равен нулю.В противном случае сообщайте пользователю, что
//уравнение не квадратное, а линейное, и вычислите его единственный корень.Если
//первые два коэффициента равны нулю, а третий не равен, сообщите пользователю,
//что корней нет.А если все коэффициенты равны нулю, сообщите, что любое число
//является корнем.