//»спользу€ созданные в предыдущих пунктах макросы дл€ работы с отдельными
//битами, создать программу, котора€ читает с клавиатуры однобайтовое беззнаковое
//целое a и маску Ц последовательность из 8 символов УXФ, У—Ф или УSФ.ѕервым
//вводитс€ младший бит маски, последним Ц старший.„исло a измен€етс€ в
//соответствии с маской : если в некотором бите маски стоит УXФ, то значение
//соответствующего бита a не измен€етс€, если маска содержит У—Ф, соответствующий
//бит числа a сбрасываетс€, если маска содержит УSФ, соответствующий бит числа a
//устанавливаетс€.Ќа экран в столбец вывод€тс€ : введенное число a в дес€теричной
//системе счислени€, a в двоичной системе счислени€, маска, результирующее число в
//двоичной системе счислени€ и результирующее число в дес€теричной системе
//счислени€.