//¬ текстовом редакторе создайте текстовый файл и запишите в этот файл
//произвольный текст.—оздайте программу, провер€ющую, нет ли среди этого текста
//последовательности символов вида : У[N = сссс]Ф, где сссс Ц целое число, которое
//может измен€тьс€ в диапазоне от - 100 до 100. ћежду знаком У = Ф и числом, а также
//между числом и символом У]Ф может быть произвольное количество пробелов и
//символов табул€ции.≈сли указанна€ последовательность обнаружена, вывести на
//экран считанное число, умноженное на 2. ≈сли последовательность не обнаружена,
//или если считанное значение выходит за границы указанного диапазона, то вывести
//на экран соответствующее сообщение.