//ѕрочитать данные из файла Уsignal.txtФ, созданного при выполнении одного из
//предыдущих заданий.—охранить данные в типизированный файл Уsignal_t.datФ в
//виде последовательности значений типа char с чередованием, т.е.первый байт
//Уsignal_t.datФ будет содержать первое значение из первого столбца Уsignal.txtФ,
//второй байт Ц первое значение из второго столбца Уsignal.txtФ, третий байт Ц второе
//значение из первого столбца Уsignal.txtФ и т.д.Ёто типичный формат сохранени€
//данных приборов при проведении многоканальных измерений.—равните размеры
//файлов Уsignal.txtФ и Уsignal_t.datФ, содержащих одинаковую информацию в разных
//форматах.